import customer1 from "./assets/customer-logo/customer1.webp";
import customer2 from "./assets/customer-logo/customer2.webp";
import customer3 from "./assets/customer-logo/customer3.webp";
import customer4 from "./assets/customer-logo/customer4.webp";
import customer5 from "./assets/customer-logo/customer5.webp";
import customer6 from "./assets/customer-logo/customer6.webp";
import ser1 from "./assets/services/ser1.webp";
import ser2 from "./assets/services/ser2.webp";
import ser3 from "./assets/services/ser3.webp";
import por1 from "./assets/portfolio/1.webp";
import logo1 from "./assets/portfolio/logo1.png";
import bgServ1 from "./assets/services/bgSer1.webp";
import bgServ2 from "./assets/services/bgSer2.webp";
import bgServ3 from "./assets/services/bgSer3.webp";
import subimg1 from "./assets/services/subimg1.webp";
import subimg2 from "./assets/services/subimg2.webp";
import subimg3 from "./assets/services/subimg3.webp";

export const CustomerData = [
  { id: "1", img: customer1 },
  { id: "2", img: customer2 },
  { id: "3", img: customer3 },
  { id: "4", img: customer4 },
  { id: "5", img: customer5 },
  { id: "6", img: customer6 },
];

export const ServicesData = [
  {
    id: "1",
    name: "تصميم المواقع الإلكترونية ",
    path: "تصميم-المواقع",
    img: ser1,
    subimg: subimg1,
    bgImg: bgServ1,
    Cardinfo:
      "  خدمة تصميم المواقع الإلكترونية تقدم حلولًا متكاملة لبناء وتطوير مواقع الويب بمرونة وفعالية. يتمثل الهدف في تحويل الرؤى إلى واقع رقمي، هي عملية إنشاء مواقع ويب بتقنيات حديثة ومتقدمة، تلبي احتياجات العملاء وتساعدهم على تحقيق أهدافهم الرقمية بكفاءة وفعالية.",
    serBenefit: {
      submain: "الحصول على موقع إلكتروني يوفر العديد من الفوائد منها:",

      list: [
        "الوجود الرقمي: يسمح لعملك بالوجود على الإنترنت، مما يزيد من مدى وصولك إلى عملائك المحتملين.",
        "الاحترافية: يعكس الموقع الإلكتروني احترافية عملك، ويساعد في بناء الثقة لدى العملاء المحتملين.",
        "تعزيز العلامة التجارية: يمكنك توفير هوية مرئية متميزة وتعزيز العلامة التجارية لعملك من خلال الموقع الإلكتروني",
        "زيادة المبيعات: يمكن أن يساهم الموقع الإلكتروني في زيادة المبيعات من خلال توفير منصة لعرض منتجاتك وخدماتك وجذب المزيد من العملاء.",
        "التواصل مع العملاء: يوفر الموقع الإلكتروني وسيلة للتواصل مع العملاء، سواءً لتقديم الدعم أو جمع التعليقات والاستفسارات",
        "الوصول العالمي: يمكن للموقع الإلكتروني أن يصل إلى جمهور عالمي، مما يتيح لعملك فرصًا جديدة للنمو والتوسع.",
      ],
    },
    serDesc:
      "خدمة تصميم المواقع الإلكترونية تقدم حلولًا متكاملة لبناء وتطوير مواقع الويب بمرونة وفعالية",
    serDesc1:
      "يتمثل الهدف في تحويل الرؤى إلى واقع رقمي مبتكر وجذاب، مما يعزز تجربة المستخدم ويعزز تواجدك الرقمي. يشمل الخدمات تصميم وتطوير المواقع بتقنيات حديثة واستجابة لجميع الأجهزة، بالإضافة إلى تخصيص وتهيئة المحتوى بشكل متقن.",
    serDesc2:
      "تعتمد الخدمة على فريق من المتخصصين في تصميم الواجهة وبرمجة الويب، مع التركيز على جودة الأداء وتحقيق أهداف العملاء بأفضل الطرق الممكنة. نحن هنا لتلبية احتياجاتك في تطوير وتصميم المواقع الإلكترونية. نحن فريق من المحترفين في مجال تكنولوجيا المعلومات وتصميم الويب، ونهدف إلى تقديم خدمة شاملة ومبتكرة لمساعدتك في بناء وتطوير موقع إلكتروني متميز يلبي احتياجاتك ويرضي زوارك.",
    serDesc3:
      " تحسين محركات البحث (SEO) سنعمل على تحسين موقعك لمحركات البحث لزيادة رؤية موقعك وزيادة حركة المرور العضوية. سنستخدم أفضل الممارسات في تحسين العناصر الأساسية مثل العنوان، الوصف، الكلمات الرئيسية، وغيرها لتحقيق نتائج أفضل في محركات البحث.",
    serDesc4:
      " سنستخدم تقنيات البرمجة الحديثة والأدوات المناسبة لضمان أداء موقعك بكفاءة وسلاسة.  استجابة التصميم (Responsive Design) سنقدم تصميمًا يتكيف بسلاسة مع مختلف الأجهزة والشاشات، بحيث يبدو ويعمل بشكل رائع على الحواسيب المكتبية والهواتف المحمولة والأجهزة اللوحية. سيكون موقعك متاحًا للزوار في أي وقت ومن أي مكان.",
    strategy: {
      id: 1,
      steps: [
        {
          name: "تحليل الاحتياجات",
          val: "سنقوم بالاستماع إلى متطلباتك وفهم أهدافك ورؤيتك للموقع. سنعمل معك على وضع استراتيجية تطوير ملائمة تلبي احتياجاتك الفريدة",
        },
        {
          name: "تصميم واجهة مستخدم جذابة",
          val: "سنقوم بتصميم واجهة مستخدم مرئية وجذابة تعكس هويتك وتجذب الزوار. سنهتم بتحقيق توازن مثالي بين التصميم الجمالي وسهولة الاستخدام",
        },
        {
          name: "تطوير البرمجيات والوظائف",
          val: " سنقوم بتحويل التصميمات إلى واقع رقمي من خلال تطوير برمجيات ووظائف متقدمة. سنستخدم تقنيات البرمجة الحديثة والأدوات المناسبة لضمان أداء موقعك بكفاءة وسلاسة",
        },
        {
          name: "إدارة المحتوى",
          val: "سنوفر لك نظام إدارة محتوى سهل الاستخدام يمكنك من إضافة وتحرير المحتوى بسهولة دون الحاجة إلى معرفة تقنية عميقة. ستتمكن من تحديث المحتوى وإدارة صفحات الموقع ونشر المقالات والأخبار بكل سهولة",
        },
      ],
    },
  },
  {
    id: "2",
    name: "برمجة تطبيقات الهاتف",
    path: "برمجة-التطبيقات",
    img: ser2,
    subimg: subimg2,
    bgImg: bgServ2,
    Cardinfo:
      "برمجة تطبيقات الهاتف هي عملية تطوير تطبيقات متنقلة على أنظمة تشغيل الهواتف المحمولة مثل iOS وAndroid. تشمل هذه الخدمة تصميم وتطوير التطبيقات بأساليب مبتكرة وتقنيات حديثة، مع التركيز على تجربة المستخدم السلسة والأمان العالي، وتحقيق أهداف العميل بشكل فعال.",
    serBenefit: {
      submain: "الحصول على تطبيق خاص بمشروعك يوفر العديد من الفوائد، منها:",

      list: [
        "الوصول السهل: يسمح التطبيق للعملاء بالوصول إلى خدماتك أو منتجاتك بسهولة عبر هواتفهم الذكية في أي وقت ومن أي مكان.",
        "التفاعلية: يمكنك توفير تجربة مستخدم متفاعلة ومميزة من خلال التطبيق، مما يساهم في جذب العملاء وزيادة ولائهم.",
        "الإشعارات الفورية: يمكنك إرسال إشعارات مباشرة إلى مستخدمي التطبيق، مما يساعد في التواصل الفعّال معهم وتقديم العروض والتحديثات الهامة.",
        "تحليل البيانات: يمكنك جمع بيانات حول استخدام التطبيق وسلوك المستخدمين، واستخدام هذه البيانات لتحسين تجربة المستخدم وتطوير خدماتك.",
        "الابتكار والتميز: يساعدك وجود تطبيق خاص بمشروعك على التميز عن منافسيك وتقديم خدمات مبتكرة ومتطورة.",
        "التسويق والترويج: يمكنك استخدام التطبيق كأداة للتسويق والترويج لمنتجاتك أو خدماتك، وتوفير عروض خاصة وحملات تسويقية لمستخدمي التطبيق.",
        "التواجد على الشبكات الاجتماعية: يمكنك دمج التطبيق مع وسائل التواصل الاجتماعي لزيادة التفاعل والتواصل مع العملاء وزيادة وعي العلامة التجارية.",
      ],
    },
    serDesc:
      "  نحن نعتبر برمجة تطبيقات الهاتف الجوال فنًا وعلمًا، ونحن نلتزم بتوفير أفضل الحلول التقنية لعملائنا.",
    serDesc1:
      "في عصر التكنولوجيا الحديثة، أصبحت التطبيقات الهاتفية جزءًا لا يتجزأ من حياتنا اليومية. في [اسم الشركة]، نقدم خدمة برمجة تطبيقات الهاتف المخصصة لتلبية احتياجات عملك وتحقيق أهدافك الرقمية.",
    serDesc2:
      "الهدف الرئيسي من خدمة برمجة تطبيقات الهاتف هو تطوير تطبيقات متميزة وفعّالة لأنظمة التشغيل المحمولة مثل iOS وAndroid، بهدف تلبية احتياجات العملاء وتحقيق أهدافهم الرقمية. من خلال هذه الخدمة، يتم توفير التطبيقات التي توفر تجربة مستخدم مميزة وسهلة الاستخدام، وتحمل ميزات ووظائف تلبي احتياجات السوق وتلبي توقعات العملاء. تهدف خدمة برمجة تطبيقات الهواتف إلى توفير حلول تقنية مبتكرة ومنافسة تساهم في تعزيز وجود العميل على الإنترنت وتحقيق النجاح والنمو لعملهم.",
    serDesc3:
      "تعتمد [اسم الشركة] على أحدث التقنيات وأفضل الممارسات في مجال برمجة تطبيقات الهواتف لتقديم حلول فعالة ومبتكرة تلبي احتياجات عملائنا بشكل كامل.",

    strategy: {
      id: 1,
      steps: [
        {
          name: "استشارة وتحليل الاحتياجات",
          val: "سيعمل فريقنا معك على فهم رؤيتك وأهدافك للتطبيق. سنقوم بتحليل احتياجاتك بدقة وفهم المستخدمين المستهدفين والمتطلبات الوظيفية لإنشاء خطة تنفيذ شاملة.",
        },
        {
          name: "تصميم واجهة المستخدم ",
          val: "سنقوم بتصميم واجهة مستخدم جذابة وسهلة الاستخدام تعكس هوية التطبيق وتتيح تجربة مستخدم مريحة وممتعة. سنضمن التوازن المثالي بين الجمال والوظائف لضمان تجربة مرضية للمستخدمين",
        },
        {
          name: "تطوير التطبيق",
          val: " باستخدام أحدث لغات البرمجة والأدوات، سنقوم بتحويل التصميم إلى تطبيق واقعي يعمل بسلاسة ويتوافق مع متطلباتك. سنضمن استخدام أفضل الممارسات في تطوير التطبيقات لضمان جودة الشفرة والأداء العالي.",
        },
        {
          name: "اختبار و تجريب التطبيق",
          val: " سنقوم بإجراء اختبارات شاملة للتأكد من جودة واستقرار التطبيق على مختلف الأجهزة والمنصات المدعومة. سنقوم بالتأكد من عمل التطبيق بشكل صحيح وفقًا للمتطلبات ونقوم بإصلاح أي أخطاء تظهر خلال عملية الاختبار.",
        },
      ],
    },
  },
  {
    id: "3",
    path: "تصميم-الهوية-التجارية",
    name: "تصميم هوية تجارية",
    img: ser3,
    subimg: subimg3,
    bgImg: bgServ3,
    Cardinfo:
      "تصميم هوية تجارية هو عملية إنشاء هوية مميزة وفريدة للعلامة التجارية، تتضمن عناصر مثل الشعار، والألوان، والأسلوب البصري، والرسائل التسويقية. يهدف هذا التصميم إلى تعزيز الهوية والتفرد للعلامة التجارية، وخلق انطباع قوي ومميز في أذهان الجمهور المستهدف.",
    serBenefit: {
      submain:
        "خدمة تصميم الهوية التجارية توفر العديد من الفوائد للعملاء، منها:",

      list: [
        "تميز العلامة التجارية: تساعد هوية تجارية متميزة على جعل علامتك التجارية مميزة ومتميزة عن منافسيك في السوق.",
        "بناء الثقة: تساعد الهوية التجارية الاحترافية والجذابة على بناء الثقة لدى العملاء وتعزيز الانطباعات الإيجابية حول عملك.",
        "تعزيز الذاكرة: يمكن لتصميم هوية تجارية قوية أن تساعد في تعزيز الذاكرة والتميز بين العملاء وتحفيزهم على تذكر علامتك التجارية بسهولة.",
        "توحيد العلامة التجارية: توفر الهوية التجارية توجيهًا واضحًا للعلامة التجارية بشأن كيفية استخدام الشعارات والألوان والأساليب البصرية الأخرى، مما يساعد في توحيد الهوية التجارية عبر جميع القنوات والمواد التسويقية.",
        "جذب العملاء الجدد: توفر هوية تجارية قوية واحترافية دليلًا بصريًا قويًا يمكن استخدامه في الإعلانات والتسويق لجذب العملاء الجدد وزيادة التفاعل مع علامتك التجارية.",
        "تحقيق الاستقلالية: يمكن للهوية التجارية أن تساعد الشركات الصغيرة والمتوسطة في بناء هويتها وتعزيز حضورها في السوق، مما يساعدها على الاستقلالية والنجاح في التنافس",
      ],
    },
    serDesc:
      "نقوم بتشكيل العواطف والأفكار والأحلام إلى رموز بصرية تترجم للغة العلامة التجارية.",
    serDesc1:
      "تقدم شركتنا خدمة تصميم هوية تجارية شاملة ومتكاملة تهدف إلى إنشاء هوية مميزة واحترافية لعملك. نحن نعمل على تطوير عناصر الهوية التجارية مثل الشعار، والألوان، والخطوط، والأيقونات، والأسلوب البصري، والعناصر الجرافيكية الأخرى التي تعكس شخصية علامتك التجارية وتضفي عليها الهوية والتميز.",
    serDesc2:
      "نحن نحيل الأفكار إلى حقيقة بأناقة، مع تركيز عميق على التفاصيل الدقيقة والأساليب الإبداعية. فنحن لا نبني فقط هويات، بل نبني قصصًا تحكي عن شخصيات واقعية وملهمة. باختصار، نحن نحول الأفكار إلى واقع يمكن رؤيته وملموس، مما يجعل علامتك التجارية تبرز في سوق اليوم المتنافس.",
    serDesc3:
      " نهتم بفهم متطلبات عملك وأهدافك الفريدة، ونقدم استراتيجية تصميم مخصصة تتناسب مع رؤيتك وهويتك الفريدة, يضمن فريقنا المتميز من المصممين تقديم تصميمات عالية الجودة واحترافية تعبر عن جوهر علامتك التجارية وتجذب انتباه العملاء,  نعمل على توحيد العلامة التجارية عبر جميع القنوات والمنصات لضمان تميز واستمرارية الهوية التجارية.",
    serDesc4:
      "نلتزم بتقديم العمل في المواعيد المحددة مسبقًا، مما يساعد على تحقيق أهدافك التسويقية والتشغيلية بشكل فعّال, بعد التسليم، نقدم دعمًا ما بعد التسليم وإجراء التعديلات اللازمة لضمان رضا العملاء وتحقيق أهدافهم.",
    strategy: {
      id: 1,
      steps: [
        {
          name: "فهم عميق لاحتياجات العميل",
          val: "نولي اهتمامًا كبيرًا لفهم عميق لاحتياجات العميل وأهدافه ورؤيته لعلامته التجارية، حيث نجري مقابلات دقيقة ونستخدم أدوات التحليل المتقدمة للحصول على رؤية شاملة.",
        },
        {
          name: "تطبيق استراتيجية تصميم مبتكرة",
          val: "نعتمد استراتيجيات تصميم مبتكرة ومخصصة لكل عميل، حيث نضع أهدافًا واضحة ونستخدم الإبداع والابتكار في إيجاد حلول فريدة تعبر عن هوية العلامة التجارية بشكل مميز.",
        },
        {
          name: "جودة وتفاني في التنفيذ",
          val: "نحرص على تقديم أعلى مستويات الجودة في كل مرحلة من مراحل عملية التصميم، مع الالتزام بالمواعيد المحددة وتقديم نتائج متميزة تفوق توقعات العميل.",
        },
        {
          name: "تفاعل وتعاون مع العميل",
          val: "نؤمن بأهمية التفاعل المستمر مع العميل والتعاون الوثيق لضمان تحقيق رؤيته ورضاه التام عن النتائج، حيث نقدم منصات وسيلة سهلة الاستخدام للتواصل المستمر وتقديم المراجعات والتعديلات.",
        },
      ],
    },
  },
  {
    id: "4",
    name: "التسويق الالكتروني ",
    path: "تسويق-الالكتروني",
    img: ser1,
    Cardinfo: "",
  },
  {
    id: "5",
    name: "انظمة الشركات",
    path: "انظمة-الشركات",
    img: ser1,
    Cardinfo: "",
  },
];

export const PortfolioData = [
  {
    id: 1,
    des: "",
    type: "برمجة مواقع خاصة ",
    cusname: "شركة Magnify",
    img: por1,
    logo: logo1,
    bgColor: "#d9b693",
    path: "Magnify",
  },
];
